In [171]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [172]:
df.count()

A    5
B    5
C    5
dtype: int64

In [173]:
df.A.count()

5

In [174]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [175]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [176]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [177]:
x = pd.Series([7, 7, 7], index=[100, 200, 300])
df = pd.concat([df, pd.DataFrame(x).T], ignore_index=True)
df

     A     B     C  100  200  300
0  0.0  10.0  20.0  NaN  NaN  NaN
1  1.0  11.0  21.0  NaN  NaN  NaN
2  2.0  12.0  22.0  NaN  NaN  NaN
3  3.0  13.0  23.0  NaN  NaN  NaN
4  4.0  14.0  24.0  NaN  NaN  NaN
5  NaN   NaN   NaN  7.0  7.0  7.0

In [178]:
y = pd.Series([7, 7, 7], index=[100, 200, 300])
df = pd.concat([df, pd.DataFrame(y).T], ignore_index=True)
df

     A     B     C  100  200  300
0  0.0  10.0  20.0  NaN  NaN  NaN
1  1.0  11.0  21.0  NaN  NaN  NaN
2  2.0  12.0  22.0  NaN  NaN  NaN
3  3.0  13.0  23.0  NaN  NaN  NaN
4  4.0  14.0  24.0  NaN  NaN  NaN
5  NaN   NaN   NaN  7.0  7.0  7.0
6  NaN   NaN   NaN  7.0  7.0  7.0

In [179]:
import pandas as pd

# Assume this is your original DataFrame
df = pd.DataFrame({
    'A': [0, 1, 2],
    'B': [10, 11, 12],
    'C': [20, 21, 22]
})

# Create a new DataFrame with one row of data
new_row = pd.DataFrame([[0, 1, 2]], columns = df.columns)

# Use concat to append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index=True)

In [180]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  0   1   2

In [181]:
import pandas as pd

# # Assume this is your original DataFrame
# df = pd.DataFrame({
#     'A': [0, 1, 2],
#     'B': [10, 11, 12],
#     'C': [20, 21, 22]
# })

# Create a new DataFrame with one row of data
new_row = pd.DataFrame([[0, 1, 200]], columns = df.columns)

# Use concat to append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index= False)

In [182]:
df

   A   B    C
0  0  10   20
1  1  11   21
2  2  12   22
3  0   1    2
0  0   1  200

In [183]:
# Create a new DataFrame with one row of data
new_row = pd.DataFrame([[0, 1, 300]], columns = df.columns)

# Use concat to append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index= True)

In [184]:
df

   A   B    C
0  0  10   20
1  1  11   21
2  2  12   22
3  0   1    2
4  0   1  200
5  0   1  300

In [185]:
df = pd.concat([df, pd.DataFrame([['NULL', 'NULL', 'NULL']], columns = df.columns)], ignore_index=True)

In [186]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     0     1     2
4     0     1   200
5     0     1   300
6  NULL  NULL  NULL

In [187]:
df.count()

A    7
B    7
C    7
dtype: int64

In [188]:
df['A'].count()

7

In [189]:
len(df)

7

In [190]:
df = pd.concat([df, pd.DataFrame([[None, None, None]], columns = df.columns)], ignore_index=True)

In [191]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     0     1     2
4     0     1   200
5     0     1   300
6  NULL  NULL  NULL
7  None  None  None

In [192]:
df.count()

A    7
B    7
C    7
dtype: int64

In [193]:
df.A.count()

7

In [194]:
df.A.value_counts()

0       4
1       1
2       1
NULL    1
Name: A, dtype: int64

In [195]:
df.B.value_counts()

1       3
10      1
11      1
12      1
NULL    1
Name: B, dtype: int64

In [196]:
df.C.value_counts()

20      1
21      1
22      1
2       1
200     1
300     1
NULL    1
Name: C, dtype: int64

In [197]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     0     1     2
4     0     1   200
5     0     1   300
6  NULL  NULL  NULL
7  None  None  None

In [198]:
df.value_counts()

A     B     C
0     1     2       1
            200     1
            300     1
      10    20      1
1     11    21      1
2     12    22      1
NULL  NULL  NULL    1
dtype: int64

In [201]:
df.size

24

In [202]:
df.shape

(8, 3)

In [203]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     0     1     2
4     0     1   200
5     0     1   300
6  NULL  NULL  NULL
7  None  None  None

In [204]:
df.A.value_counts()

0       4
1       1
2       1
NULL    1
Name: A, dtype: int64

In [206]:
df.groupby('A').count()

      B  C
A
0     4  4
1     1  1
2     1  1
NULL  1  1

In [211]:
df.A

0       0
1       1
2       2
3       0
4       0
5       0
6    NULL
7    None
Name: A, dtype: object

In [210]:
df.A.count()

7

In [213]:
df.A.nunique()

4

In [214]:
df.A.value_counts()

0       4
1       1
2       1
NULL    1
Name: A, dtype: int64

In [215]:
df

      A     B     C
0     0    10    20
1     1    11    21
2     2    12    22
3     0     1     2
4     0     1   200
5     0     1   300
6  NULL  NULL  NULL
7  None  None  None